<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"09af22fa8914b32103fa681ae7e8c8e292f157d736f6e205b708078b335fa1c7","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1268 at https://github.com/cal-itp/data-infra/actions/runs/20727093725","plan_out_hash":"f430bd48e228ac4d78bb89abc00c8bb6f3800b68ae543faa49d9af62a6156202","plan_hash":"d4082aa383193dc4483424bf4613b81fa9f617b9a0203b8bf09e89a1aafbdbc1","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/download_config_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "EYV24w==" -> (known after apply)
!~      detect_md5hash      = "hrGWSQnQHlZQ99/ZjeykQg==" -> "different hash"
!~      generation          = 1767638389258940 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/download_config_to_gcs_operator.py"
!~      md5hash             = "hrGWSQnQHlZQ99/ZjeykQg==" -> (known after apply)
        name                = "plugins/operators/download_config_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/gtfs_csv_to_jsonl_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "R2BHIw==" -> (known after apply)
!~      detect_md5hash      = "v6TiovA1m2tNfcMGdh9IRA==" -> "different hash"
!~      generation          = 1767638389209595 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/gtfs_csv_to_jsonl_operator.py"
!~      md5hash             = "v6TiovA1m2tNfcMGdh9IRA==" -> (known after apply)
        name                = "plugins/operators/gtfs_csv_to_jsonl_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/transit_database/dimensions/.DS_Store"] will be destroyed
  # (because key ["models/intermediate/transit_database/dimensions/.DS_Store"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "application/octet-stream" -> null
-       crc32c              = "sYtuGQ==" -> null
-       detect_md5hash      = "GUV3p+IL3Mevu3GPUCwTTA==" -> null
-       event_based_hold    = false -> null
-       generation          = 1767638389193774 -> null
-       id                  = "calitp-staging-composer-data/warehouse/models/intermediate/transit_database/dimensions/.DS_Store" -> null
-       md5hash             = "GUV3p+IL3Mevu3GPUCwTTA==" -> null
-       md5hexhash          = "194577a7e20bdcc7afbb718f502c134c" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fintermediate%2Ftransit_database%2Fdimensions%2F.DS_Store?generation=1767638389193774&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/intermediate/transit_database/dimensions/.DS_Store" -> null
-       output_name         = "data/warehouse/models/intermediate/transit_database/dimensions/.DS_Store" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fintermediate%2Ftransit_database%2Fdimensions%2F.DS_Store" -> null
-       source              = "../../../../warehouse/models/intermediate/transit_database/dimensions/.DS_Store" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/.DS_Store"] will be destroyed
  # (because key ["models/mart/gtfs/.DS_Store"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "application/octet-stream" -> null
-       crc32c              = "sYtuGQ==" -> null
-       detect_md5hash      = "GUV3p+IL3Mevu3GPUCwTTA==" -> null
-       event_based_hold    = false -> null
-       generation          = 1767638389194213 -> null
-       id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/.DS_Store" -> null
-       md5hash             = "GUV3p+IL3Mevu3GPUCwTTA==" -> null
-       md5hexhash          = "194577a7e20bdcc7afbb718f502c134c" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fgtfs%2F.DS_Store?generation=1767638389194213&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/gtfs/.DS_Store" -> null
-       output_name         = "data/warehouse/models/mart/gtfs/.DS_Store" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fgtfs%2F.DS_Store" -> null
-       source              = "../../../../warehouse/models/mart/gtfs/.DS_Store" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1268](https://github.com/cal-itp/data-infra/actions/runs/20727093725)